In [61]:
import pandas as pd
import numpy as np
fpath = "./data/缼失值处理.xlsx"
#打开excel文件，并且跳过
df = pd.read_excel(fpath, skiprows=2)

(array([0, 4, 8], dtype=int64), array([3, 3, 3], dtype=int64))

In [63]:
df

    Unnamed: 0   姓名  科目    分数
0          NaN   小明  语文  85.0
1          NaN  NaN  数学  80.0
2          NaN  NaN  英语  90.0
4          NaN   小王  语文  85.0
5          NaN  NaN  数学   NaN
6          NaN  NaN  英语  90.0
8          NaN   小刚  语文  85.0
9          NaN  NaN  数学  80.0
10         NaN  NaN  英语  90.0

In [62]:
#删除所有一整行为空
df.dropna(how="all", axis=0, inplace=True)
df
np.where(df == 85)

(array([0, 3, 6], dtype=int64), array([3, 3, 3], dtype=int64))

In [43]:
#删除含有一整列的空
df.dropna(how='all', axis=1, inplace=True)
df

     姓名  科目    分数
0    小明  语文  85.0
1   NaN  数学  80.0
2   NaN  英语  90.0
4    小王  语文  85.0
5   NaN  数学   NaN
6   NaN  英语  90.0
8    小刚  语文  85.0
9   NaN  数学  80.0
10  NaN  英语  90.0

In [44]:
#填充空值
df.loc[:,'姓名'] = df['姓名'].fillna(method='ffill')
df

    姓名  科目    分数
0   小明  语文  85.0
1   小明  数学  80.0
2   小明  英语  90.0
4   小王  语文  85.0
5   小王  数学   NaN
6   小王  英语  90.0
8   小刚  语文  85.0
9   小刚  数学  80.0
10  小刚  英语  90.0

In [45]:
df.loc[:,'分数'] = df['分数'].fillna('缺考')
df

    姓名  科目    分数
0   小明  语文  85.0
1   小明  数学  80.0
2   小明  英语  90.0
4   小王  语文  85.0
5   小王  数学    缺考
6   小王  英语  90.0
8   小刚  语文  85.0
9   小刚  数学  80.0
10  小刚  英语  90.0

In [46]:
#将处理后的表格重新存储，注意index参数默认为True（显示索引），使用时应改成False
df.to_excel('./data/修改后.xlsx',index=False)
df

    姓名  科目    分数
0   小明  语文  85.0
1   小明  数学  80.0
2   小明  英语  90.0
4   小王  语文  85.0
5   小王  数学    缺考
6   小王  英语  90.0
8   小刚  语文  85.0
9   小刚  数学  80.0
10  小刚  英语  90.0

In [60]:
df.loc[5,'分数']= 0
df.loc[df['分数']>=85]

    姓名  科目    分数
0   小明  语文  85.0
2   小明  英语  90.0
4   小王  语文  85.0
6   小王  英语  90.0
8   小刚  语文  85.0
10  小刚  英语  90.0